src/DataProcessors/ИС_WB_СозданиеФайлаДляПоставок.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<DataProcessor>
		<Properties>
			<Name>ИС_WB_СозданиеФайлаДляПоставок</Name>
		</Properties>
	</DataProcessor>
</MetaDataObject>

src/InformationRegisters/ИС_WB_СоответствиеРазмеров.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<InformationRegister>
		<Properties>
			<Name>ИС_WB_СоответствиеРазмеров</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Dimension>
				<Properties>
					<Name>Профиль</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ИС_WB_Профили</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>РазмерWB</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ИС_WB_РазмерыНоменклатур</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Номенклатура</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Характеристика</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ХарактеристикиНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Упаковка</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.УпаковкиЕдиницыИзмерения</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/InformationRegisters/ИС_WB_ШтрихкодыРазмеров.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<InformationRegister>
		<Properties>
			<Name>ИС_WB_ШтрихкодыРазмеров</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Dimension>
				<Properties>
					<Name>Профиль</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ИС_WB_Профили</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Размер</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ИС_WB_РазмерыНоменклатур</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Штрихкод</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/Catalogs/ВариантыКомплектацииНоменклатуры.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Catalog>
		<Properties>
			<ObjectBelonging>Adopted</ObjectBelonging>
			<Name>ВариантыКомплектацииНоменклатуры</Name>
			<Owners>
				<xr:Item>Catalog.Номенклатура</xr:Item>
			</Owners>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>НоменклатураОсновногоКомпонента</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ХарактеристикаОсновногоКомпонента</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ХарактеристикиНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ВариантРасчетаЦеныНабора</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВариантыРасчетаЦенНаборов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Товары</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Name>Номенклатура</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Name>Характеристика</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ХарактеристикиНоменклатуры</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Name>КоличествоУпаковок</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Name>ДоляСтоимости</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Name>Количество</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

src/DataProcessors/ИС_WB_СозданиеФайлаДляПоставок/Forms/Форма/Ext/Form/Module.bsl
#Область ОбработчикиСобытийФормы

//+ ИнфоСофт Ивонин К.А. 06.03.23 УА #53535
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	ИС_WB_Сервер.ПриСозданииНаСервере(ЭтотОбъект);
КонецПроцедуры //- ИнфоСофт Ивонин К.А. 06.03.23 УА #53535

//+ ИнфоСофт Ивонин К.А. 27.09.21 УА #38645
&НаКлиенте
Процедура ПутьСохраненияНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
		
	СтандартнаяОбработка = Ложь;

	ДиалогВыбораФайла = Новый ДиалогВыбораФайла(РежимДиалогаВыбораФайла.ВыборКаталога);
    ДиалогВыбораФайла.Заголовок = "Выберите каталог для сохранения";
    ДиалогВыбораФайла.МножественныйВыбор = Ложь;
	ДиалогВыбораФайла.ПроверятьСуществованиеФайла = Истина;
    
    ДопПараметры = Новый Структура("ДиалогВыбораФайла", ДиалогВыбораФайла);
    ОписаниеОповещения = Новый ОписаниеОповещения("ПутьСохраненияНачалоВыбораЗавершение", ЭтотОбъект, ДопПараметры); 
    
    ДиалогВыбораФайла.Показать(ОписаниеОповещения);

КонецПроцедуры //- ИнфоСофт Ивонин К.А. 27.09.21 УА #38645

//+ ИнфоСофт Ивонин К.А. 10.04.23 УА #57127
&НаКлиенте
Процедура ПриОткрытии(Отказ)
	#Если ВебКлиент Тогда                         
		ПодключитьРасширениеДляРаботыСФайлами(Истина);
	#КонецЕсли
КонецПроцедуры //- ИнфоСофт Ивонин К.А. 10.04.23 УА #57127

#КонецОбласти

#Область ОбработчикиКомандФормы

//+ ИнфоСофт Ивонин К.А. 21.09.21 УА #38645
&НаКлиенте
Процедура СформироватьФайл(Команда)

	Если Не ЗначениеЗаполнено(ДокументОснование) Тогда
	    ОбщегоНазначенияКлиент.СообщитьПользователю("Поле ""Документ основание"" не заполнено", , , "ДокументОснование");
		Возврат;
	КонецЕсли;
	
	СформироватьФайлНаСервере();
	
КонецПроцедуры //- ИнфоСофт Ивонин К.А. 21.09.21 УА #38645

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

//+ ИнфоСофт Ивонин К.А. 10.04.23 УА #57127
&НаКлиенте 
Процедура ПодключитьРасширениеДляРаботыСФайлами(УстановитьЕслиНеПодключено) Экспорт  
	ОписаниеОповещения = Новый ОписаниеОповещения("ПодключитьРасширениеДляРаботыСФайламиЗавершение", ЭтотОбъект, УстановитьЕслиНеПодключено); 
	НачатьПодключениеРасширенияРаботыСФайлами(ОписаниеОповещения);
КонецПроцедуры //- ИнфоСофт Ивонин К.А. 10.04.23 УА #57127 

//+ ИнфоСофт Ивонин К.А. 10.04.23 УА #57127
&НаКлиенте
Процедура ПодключитьРасширениеДляРаботыСФайламиЗавершение(Подключено, УстановитьЕслиНеПодключено) Экспорт
	
	Если Подключено Тогда
		Возврат;
	ИначеЕсли УстановитьЕслиНеПодключено Тогда  	
		ОписаниеОповещения = Новый ОписаниеОповещения("ПодключитьРасширениеДляРаботыСФайлами", ЭтотОбъект, Ложь);     
		НачатьУстановкуРасширенияРаботыСФайлами(ОписаниеОповещения);
	Иначе
		ОбщегоНазначенияКлиент.СообщитьПользователю("Не удалось подключить расширение для работы с файлами!");
	КонецЕсли;
	
КонецПроцедуры //- ИнфоСофт Ивонин К.А. 10.04.23 УА #57127

//+ ИнфоСофт Ивонин К.А. 21.09.21 УА #38645
&НаСервере
Процедура СформироватьФайлНаСервере()
		
	МассивНоменклатур = ДокументОснование.Товары.Выгрузить(, 
		"Номенклатура,Характеристика,НоменклатураНабора,ХарактеристикаНабора,Количество");		
	МассивНоменклатур.Свернуть(
		"Номенклатура,Характеристика,НоменклатураНабора,ХарактеристикаНабора","Количество");	
	
	Запрос = Новый Запрос;
	Запрос.Текст =	
	"ВЫБРАТЬ
	|	ВариантыКомплектацииНоменклатурыТовары.Ссылка.Владелец КАК НоменклатураНабора,
	|	ВариантыКомплектацииНоменклатурыТовары.Ссылка.Характеристика КАК ХарактеристикаНабора,
	|	ВариантыКомплектацииНоменклатурыТовары.Номенклатура КАК Номенклатура,
	|	ВариантыКомплектацииНоменклатурыТовары.Характеристика КАК Характеристика,
	|	ВариантыКомплектацииНоменклатурыТовары.Количество КАК Количество
	|ИЗ
	|	Справочник.ВариантыКомплектацииНоменклатуры.Товары КАК ВариантыКомплектацииНоменклатурыТовары
	|ГДЕ
	|	ВариантыКомплектацииНоменклатурыТовары.Ссылка.Владелец В (&НоменклатураНабора)
	|	И ВариантыКомплектацииНоменклатурыТовары.Ссылка.Характеристика В (&ХарактеристикаНабора)";
				
				
	Запрос.УстановитьПараметр("НоменклатураНабора", МассивНоменклатур.ВыгрузитьКолонку("НоменклатураНабора"));                            
	Запрос.УстановитьПараметр("ХарактеристикаНабора", МассивНоменклатур.ВыгрузитьКолонку("ХарактеристикаНабора"));
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выгрузить(); 
	
	Количество = Неопределено;
	
	Пока Выборка.Количество() > 0 Цикл   
		
		НайденныеСтроки = МассивНоменклатур.НайтиСтроки(Новый Структура("НоменклатураНабора,ХарактеристикаНабора", Выборка[0].НоменклатураНабора, Выборка[0].ХарактеристикаНабора)); 
		
		Если НайденныеСтроки.Количество() > 0 Тогда
			
			Для Каждого Строка Из НайденныеСтроки Цикл 
				
				СтрокиВыборки = Выборка.НайтиСтроки(Новый Структура("НоменклатураНабора,ХарактеристикаНабора", Строка.НоменклатураНабора,  Строка.ХарактеристикаНабора)); 				
				
				Для Каждого СтрокаВыборки Из СтрокиВыборки Цикл
					
					Если Строка.Номенклатура = СтрокаВыборки.Номенклатура И СтрокаВыборки.Характеристика = Строка.Характеристика Тогда 
						
						Если Количество = Неопределено Тогда
							Количество = Цел(Строка.Количество / СтрокаВыборки.Количество);
						Иначе
							Количество = Мин(Количество, Цел(Строка.Количество / СтрокаВыборки.Количество));	
						КонецЕсли; 
						
					КонецЕсли; 
					
				КонецЦикла;	  																									
				
			КонецЦикла;
			
			Для Каждого Строка Из НайденныеСтроки Цикл 
				МассивНоменклатур.Удалить(Строка);	
			КонецЦикла;
			
			НоваяСтрока = МассивНоменклатур.Добавить();
			НоваяСтрока.Номенклатура = Выборка[0].НоменклатураНабора;
			НоваяСтрока.Характеристика = Выборка[0].ХарактеристикаНабора;
			НоваяСтрока.Количество = Количество;
			
			Для Каждого СтрокаВыборки Из СтрокиВыборки Цикл 
				Выборка.Удалить(СтрокаВыборки);	
			КонецЦикла; 
			
		Иначе
			Выборка.Удалить(0);			
		КонецЕсли;
		
	КонецЦикла;
	
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ИС_WB_СоответствиеРазмеров.Номенклатура КАК Номенклатура,
	|	МАКСИМУМ(ИС_WB_ШтрихкодыРазмеров.Штрихкод) КАК Штрихкод,
	|	ИС_WB_СоответствиеРазмеров.Характеристика КАК Характеристика
	|ИЗ
	|	РегистрСведений.ИС_WB_СоответствиеРазмеров КАК ИС_WB_СоответствиеРазмеров
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ИС_WB_ШтрихкодыРазмеров КАК ИС_WB_ШтрихкодыРазмеров
	|		ПО (ИС_WB_СоответствиеРазмеров.РазмерWB = ИС_WB_ШтрихкодыРазмеров.Размер)
	|ГДЕ
	|	ИС_WB_СоответствиеРазмеров.Номенклатура В(&Номенклатура)
	|	И ИС_WB_СоответствиеРазмеров.Характеристика В(&Характеристика)
	|	И ИС_WB_СоответствиеРазмеров.Профиль = &Профиль
	|
	|СГРУППИРОВАТЬ ПО
	|	ИС_WB_СоответствиеРазмеров.Номенклатура,
	|	ИС_WB_СоответствиеРазмеров.Характеристика";
	
	Запрос.УстановитьПараметр("Номенклатура", МассивНоменклатур.ВыгрузитьКолонку("Номенклатура"));
	Запрос.УстановитьПараметр("Характеристика", МассивНоменклатур.ВыгрузитьКолонку("Характеристика"));
	Запрос.УстановитьПараметр("Профиль", Профиль);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать();
	
	ТаблицаВыгрузки = Новый ТаблицаЗначений;
	ТаблицаВыгрузки.Колонки.Добавить("Баркод");
	ТаблицаВыгрузки.Колонки.Добавить("Количество");
	
	Пока Выборка.Следующий() Цикл
		
		НайденныеСтроки = МассивНоменклатур.НайтиСтроки(Новый Структура("Номенклатура,Характеристика", Выборка.Номенклатура, Выборка.Характеристика));
		
		Если НайденныеСтроки.Количество() > 0 Тогда  
			НоваяСтрока = ТаблицаВыгрузки.Добавить();
			НоваяСтрока.Баркод = Выборка.Штрихкод;
			НоваяСтрока.Количество = Окр(НайденныеСтроки[0].Количество, 0, РежимОкругления.Окр15как10);  
			МассивНоменклатур.Удалить(НайденныеСтроки[0]);
		КонецЕсли;
		
	КонецЦикла;
	
	Для Каждого Элемент Из МассивНоменклатур Цикл
		ОбщегоНазначения.СообщитьПользователю("Для номенклатуры: " + Элемент.Номенклатура + " не найдено сопоставление номенклатуры WB, она не будет добавлена в файл!");
	КонецЦикла;
	
	ТабличныйДокумент = Новый ТабличныйДокумент;
	
	Построитель = Новый ПостроительОтчета;
	Построитель.ИсточникДанных = Новый ОписаниеИсточникаДанных(ТаблицаВыгрузки); 
	Построитель.ВыводитьЗаголовокОтчета = Ложь;
	Построитель.Вывести(ТабличныйДокумент);
	
	ТабличныйДокумент.АвтоМасштаб = Истина;
	ТабличныйДокумент.УдалитьОбласть(ТабличныйДокумент.Область("R1C1:R100C1"), ТипСмещенияТабличногоДокумента.ПоГоризонтали);
	ТабличныйДокумент.Область("R1C1:R100C1").ШиринаКолонки = 20;
	ТабличныйДокумент.Область("R1C2:R100C2").ШиринаКолонки = 20;
	
	ДокументВыгрузки = ТабличныйДокумент;
	
КонецПроцедуры //- ИнфоСофт Ивонин К.А. 21.09.21 УА #38645

//+ ИнфоСофт Ивонин К.А. 27.09.21 УА #38645
&НаКлиенте
Процедура СохранитьФайл(Команда)

	Если Не ЗначениеЗаполнено(ПутьСохранения) Тогда
		ОбщегоНазначенияКлиент.СообщитьПользователю("Поле ""Путь сохранения"" не заполнено", , , "ПутьСохранения");
		Возврат;
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(ИмяФайла) Тогда
		ОбщегоНазначенияКлиент.СообщитьПользователю("Поле ""Имя файла"" не заполнено!", , , "ИмяФайла");
		Возврат;
	КонецЕсли;
	
	Попытка
		ПутьСохраненияФайла = СтрШаблон("%1/%2.xlsx", ПутьСохранения, ИмяФайла);
		ДокументВыгрузки.Записать(ПутьСохраненияФайла, ТипФайлаТабличногоДокумента.XLSX);
		ОбщегоНазначенияКлиент.СообщитьПользователю("Файл " + ПутьСохраненияФайла + " успешно сохранен");
	Исключение
		ОбщегоНазначенияКлиент.СообщитьПользователю(ОписаниеОшибки());
	КонецПопытки;
	
КонецПроцедуры //- ИнфоСофт Ивонин К.А. 27.09.21 УА #38645

//+ ИнфоСофт Ивонин К.А. 27.09.21 УА #38645
&НаКлиенте
Процедура ПутьСохраненияНачалоВыбораЗавершение(Результат, ДополнительныеПараметры) Экспорт

	ДиалогВыбораФайла = ДополнительныеПараметры.ДиалогВыбораФайла;
    Если Результат = Неопределено Тогда
    	Возврат;
    КонецЕсли;
    
    Если ДиалогВыбораФайла.Каталог <> Неопределено Тогда   	
    	ПутьСохранения = ДиалогВыбораФайла.Каталог;			
    КонецЕсли;
        
КонецПроцедуры //- ИнфоСофт Ивонин К.А. 27.09.21 УА #38645

#КонецОбласти
